[
      {  "id": 100,
      "projectImage": "zachs-esn_keystrokes.png",
      "projectTitle": "Neural Keystroke Dynamics",
      "projectDesc":
        "Two of my colleagues (Jeremy Speth and Zach Carmichael) at Notre Dame and I built an Echo State Network (ESN) to process raw long-text input from a Keylogger in order to identify users based on their typing features, such as dwell time, and key latency. I was primarily responsible for the Keylogger GUI along with data collection and processing. Our model underperforms the state-of-the-art, but has a better run-time efficiency for a real system. Full credit goes to Zach for building the model and the pretty topology.",
      "projectLink": "KeyloggerGUI",
      "pageLink": "neural_keystrokes",
      "contentOne": "<div><p>Project contents coming soon!</p></div>",
      "contentTwo": ""
    },
    {
    "id": 101,
      "projectImage": "peace_cloud.png",
      "projectTitle": "3D Hand Gesture Classification",
      "projectDesc":
        "For my semester project in Graduate Computer Vision I, I was curious whether or not I could classify 4 different hand gestures using the features from their 3D point clouds generated from SfM, specifically Colmap's algorithm.",
      "projectLink": "3DHandClassification",
      "pageLink": "hand_classifier",
      "contentOne": "<div><p>Project contents coming soon!</p></div>",
      "contentTwo": ""
    },
    {
      "id": 5,
      "projectImage": "reactLogo.png",
      "projectTitle": "ReactJS Portfolio Site",
      "projectDesc":
        "I built a Single Page Application portfolio site using the React JS library, all of which is hosted on Github Pages. I also use the GitHub API to pull current repository information. Prior to this experience, I had very little JavaScript exposure and no ReactJS background. It has been a great experience learning how the React Server DOM helps optimize runtime of Front End UIs. Hope you enjoy the site! Check out my source branch on GitHub if you would like to mimic this style.",
      "projectLink": "adraper2.github.io",
      "pageLink": "portfolio_site",
      "contentOne": "<div><p>This website explores the use of several React concepts including:</p><ul><li>the React Server DOM</li><li>Single Page Application (SPA) design</li><li>the React Router within the App.js script</li><li>parent-child relationships within JSX components</li><li>and more that I definitely am spacing about :)</li></ul><p>I was motivated to pursue this project for three reasons: 1) I always stunk at Javascript so I thought this would be a great way to dive deep into a tool I had avoided. 2) I really wanted to move away from drag-and-drop sites. I previously used an Adobe portfolio site. It looked nice, but I always felt like I was cheating given my Computer Science background. Plus, financially, this site makes much more sense. I pay a dollar for the domain and host it free on GitHub pages! 3) I would like more exposure to heirarchical coding. Most of my projects are script-based so I usually do not get to practice software developing habits. This was a nice change of pace before starting graduate school at Notre Dame.</p></div>",
      "contentTwo": ""
    },
    {
      "id": 1,
      "projectImage": "zoom_noise.png",
      "projectTitle": "Visual Perceptions of Image Denoising",
      "projectDesc":
        "This was a research endeavor at Elon University into college students' visual perceptions of denoised images. In this paper, we apply common inferential kernel filters in the R and python languages, as well as Adobe Lightroom's denoise filter, and compare their effectiveness in removing noise from JPEG images. We ran standard benchmark tests to evaluate each method's effectiveness for removing noise. In doing so, we also surveyed students at Elon University about their opinion of a single filtered photo from a collection of photos processed by the various filter methods. Many scientists believe that noise filters cause blurring and image quality loss so we analyzed whether or not people felt as though denoising causes any quality loss as compared to their noiseless images. Survey scores are compared across filters to evaluate whether there were significant differences in image quality scores received. An analysis of covariance test was run to identify whether or not survey training scores explained any unplanned variation in visual scores assigned by students across the filter methods.",
      "projectLink": "Noise_Reduction_Research-STS499",
      "pageLink": "noise_reduction",
      "contentOne": "<p>This project started in early September and finished in Febrauary with the submission of an article to a research journal. My mentor, Dr. Laura Taylor, and I presented our work at two conferences (eUSR and UNCG RMSC) during the fall semester and then, submitted a final paper to the North Carolina Journal of Mathematics and Statistics in February of 2019. I have attached the final presentation for the eUSR conference along with more content about the project.</p>",
      "contentTwo": ""
    },
    {
      "id": 2, 
      "projectImage": "prediction_visual_scam2.png",
      "projectTitle": "DISC REU: Marshland Random Forest Model",
      "projectDesc":
        "This is an on going research area in the McLachlan Lab at the University of Notre Dame. The goal of this project is to implement a similar methodology implemented by Meghan Vahsen (a graduate student in the lab who classified Tamarisk in the Colorado River Basin) to monitor population abundance of species of sedge and grass in the Chesapeake. In particular, we have data from the Smithsonian Environmental Research Center's marshland plots.",
      "projectLink": "DISC_chesapeake",
      "pageLink": "DISC_chesapeake",
      "contentOne": "",
      "contentTwo": ""
    },
    {
    "id": 3,
      "projectImage": "chopper_results.png",
      "projectTitle": "DISC REU: Bayesian Hierarchical Model",
      "projectDesc":
        "We recreated a Bayesian Poisson point process model from a paper written by Malcolm Itter. Malcolm Itter is a PhD candidate at Michigan State University studying forest demographic processes. The Bayesian model attempts to predict local fires surrounding lakes by investigating charcoal counts from the past as an indicator of a regional or local fire. The Poisson process is a fitting addition to the model given the use of charcoal counts. With that being said, the original model was developed on the notion that charcoal data could be separated into a background and a foreground where the background represents regional fire noise and the foreground represents peak charcoal amounts that are caused by a local fire. This idea held true in Alaskan lakes, but now we are interested as to whether or not this is the case with lakes residing in the Midwest. We have 18 lakes of interest that we will model separately first and then, jointly.",
      "projectLink": "DISC_bayesian",
      "pageLink": "DISC_bayesian",
      "contentOne": "",
      "contentTwo": ""
    },
    {
    "id": 4,
      "projectImage": "spotify_mood.jpg",
      "projectTitle": "Mood Analysis of a Spotify Saved Music Library",
      "projectDesc":
        "In this project, I analyze the sentiment and lyrics in my own Spotify Saved Music library. I implement Gensim's LDA Topic Modeling, NLTK's Vader Sentiment Analyzer, and a multiple linear regression on data that I pull from the Spotify and Genius APIs. The project served as my final for CSC 401 - Data Mining and Machine Learning.",
      "projectLink": "CSC401-Final-Project",
      "pageLink": "mood_analysis",
      "contentOne": "",
      "contentTwo": ""
    },
    {
    "id": 6,
      "projectImage": "kendrick.jpeg",
      "projectTitle": "Spotitry: A Personalized Music Playlist Generator",
      "projectDesc":"During December of 2017, Marcus Zimmermann and Aidan Draper decided to spend their spare time developing an algorithm to fetch new music for users based on their 'short term' listening habits. Using a variety of variables, including a popularity rating < 50, the top 3 genres, similar artists, and grouping based on audio features, they developed two playlists unique to their accounts below. This is still a work in progress and currently the python script only grabs the top search result for each query run. The entire repository can be found here.",
      "projectLink": "spotitry",
      "pageLink": "spotitry",
      "contentOne": "",
      "contentTwo": "",
      "contentThree": "",
      "contentFour": ""
    },
    {
      "id": 7,
      "projectImage": "clt.png",
      "projectTitle": "Central Limit Theorem Shiny Application",
      "projectDesc": "This was the final project for our STS 347, Statistical Modeling in R, class. For the project, we created a Shiny App within R to show to statistical and non-statistical audiences how the Central Limit Theorem works. This app was created by Aidan Draper, Christian Wagner, Chris Laskay, and Graham Parker.",
      "projectLink": "sts347-final",
      "pageLink": "CLT_shiny",
      "contentOne": "",
      "contentTwo": ""
    }
]